/**
* 父亲将2520个桔子分给六个儿子。
* 分完后父亲说：“老大将分给你的桔子的1/8给老二；
* 老二拿到后连同原先的桔子分1/7给老三；
* 老三拿到后连同原先的桔子分1/6给老四；
* 老四拿到后连同原先的桔子分1/5给老五；
* 老五拿到后连同原先的桔子分1/4给老六；
* 老六拿到后连同原先的桔子分1/3给老大”。
* 结果大家手中的桔子正好一样多。
* 问六兄弟原来手中各有多少桔子？
*
*/

void fjzwt_result(int* num1, int* num2) {
	int i = 0;
	int a[6] = { 0 };
	int left = 0;
	int avg = 420;
	for (i = 0; i < 6; i++)
	{
		if (i == 0)
		{
			a[i] = (avg - 210) * (8 - i) / (7 - i) - left;
			left = a[i] + left - (avg - 210);
		}
		else
		{
			a[i] = avg * (8 - i) / (7 - i) - left;
			left = a[i] + left - avg;
		}
	}
	*num1 = i;
	*num2 = a[i - 1];
}